#  Merge data : 


- Merge data from relational dataset to main dataset

# 1)-Importing key modules

In [1]:
# To avoid warnings Message 
import warnings
warnings.filterwarnings('ignore')
# For processing
import pandas as pd
import numpy as np
import scipy

# 2)-Loading data

In [2]:
df_event = pd.read_csv('events.csv')
df_event.shape

(47007, 9)

In [3]:
df_event.event_type.value_counts()

search    45198
book       1809
Name: event_type, dtype: int64

In [4]:
df_event.columns

Index(['ts', 'event_type', 'user_id', 'date_from', 'date_to', 'origin',
       'destination', 'num_adults', 'num_children'],
      dtype='object')

In [5]:
df_event.head()

,ts,event_type,user_id,date_from,date_to,origin,destination,num_adults,num_children
0,2017-04-27 11:06:51,search,60225f,2017-06-01,2017-06-07,PAR,NYC,6,1
1,2017-04-27 20:15:27,book,e5d69e,2017-08-12,2017-09-02,FRA,WAS,3,1
2,2017-04-27 23:03:43,book,f953f0,2017-10-08,2017-10-11,BER,CGN,2,0
3,2017-04-27 15:17:50,book,794d35,2017-04-28,2017-05-01,BER,BCN,1,0
4,2017-04-27 22:51:57,book,ca4f94,2017-05-16,2017-05-22,DEL,BKK,4,0

In [6]:
df_event.event_type.unique()

array(['search', 'book'], dtype=object)

# 3)- Loading Relational dataset

In [7]:
df_geo = pd.read_csv('iata_1_1.csv')

df_geo.shape

(500, 3)

In [8]:
df_geo.head()

  iata_code    lat    lon
0       LON  51.50  -0.17
1       MOW  55.75  37.70
2       NYC  40.71 -74.01
3       PAR  48.85   2.35
4       IST  41.01  28.95

In [9]:
df_geo[df_geo.iata_code == "PAR"]

  iata_code    lat   lon
3       PAR  48.85  2.35

In [9]:
df_geo[df_geo.iata_code == "NYC"]

  iata_code    lat    lon
2       NYC  40.71 -74.01

# 4)-Combining dataset

### a)- Working with orgin

In [10]:
df_origin=pd.DataFrame(columns=["origin"])
df_origin['origin']=df_event['origin']
df_origin['origin_lat']=np.nan
df_origin.head(2)

  origin  origin_lat
0    PAR         NaN
1    FRA         NaN

In [11]:
for k in range(len(df_origin)):
    df_origin['origin_lat'][k] = (df_geo['lat'][df_geo['iata_code']==df_origin['origin'][k]][df_geo['lat'][df_geo['iata_code']==df_origin['origin'][k]].index[0]])

In [12]:
df_origin.head(2)

  origin  origin_lat
0    PAR       48.85
1    FRA       50.12

In [13]:
df_origin['origin_lon']=np.nan

In [14]:
for k in range(len(df_origin)):
    df_origin['origin_lon'][k] = (df_geo['lon'][df_geo['iata_code']==df_origin['origin'][k]][df_geo['lon'][df_geo['iata_code']==df_origin['origin'][k]].index[0]])

In [15]:
df_origin.head(2)

  origin  origin_lat  origin_lon
0    PAR       48.85        2.35
1    FRA       50.12        8.68

In [16]:
df_origin.shape

(47007, 3)

### b)-working with destination

In [17]:
df_destination=pd.DataFrame(columns=["destination"])

In [18]:
df_destination['destination']=df_event['destination']
df_destination.head(2)

  destination
0         NYC
1         WAS

In [19]:
df_destination['destination_lat']=np.nan
df_destination['destination_lon']=np.nan

In [20]:
for k in range(len(df_destination)):
    df_destination['destination_lat'][k] = (df_geo['lat'][df_geo['iata_code']==df_destination['destination'][k]][df_geo['lat'][df_geo['iata_code']==df_destination['destination'][k]].index[0]])
    df_destination['destination_lon'][k] = (df_geo['lon'][df_geo['iata_code']==df_destination['destination'][k]][df_geo['lon'][df_geo['iata_code']==df_destination['destination'][k]].index[0]])

In [21]:
df_destination.head(2)

  destination  destination_lat  destination_lon
0         NYC            40.71           -74.01
1         WAS            38.90           -77.04

**Adding to main dataset**

In [22]:
df_event['origin_lat'] = df_origin['origin_lat']
df_event['origin_lon'] = df_origin['origin_lon']

In [23]:
df_event['destination_lat']= df_destination['destination_lat']
df_event['destination_lon']=df_destination['destination_lon']

In [24]:
df_event.head(2)

,ts,event_type,user_id,date_from,date_to,origin,destination,num_adults,num_children,origin_lat,origin_lon,destination_lat,destination_lon
0,2017-04-27 11:06:51,search,60225f,2017-06-01,2017-06-07,PAR,NYC,6,1,48.85,2.35,40.71,-74.01
1,2017-04-27 20:15:27,book,e5d69e,2017-08-12,2017-09-02,FRA,WAS,3,1,50.12,8.68,38.90,-77.04